7767517
175 188
Input            input0                   0 1 input0
Convolution      295                      1 1 input0 295 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216
BatchNorm        296                      1 1 295 296 0=8
ReLU             297                      1 1 296 297 0=1.000000e-01
ConvolutionDepthWise 298                      1 1 297 298 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=72 7=8
BatchNorm        299                      1 1 298 299 0=8
ReLU             300                      1 1 299 300 0=1.000000e-01
Convolution      301                      1 1 300 301 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        302                      1 1 301 302 0=16
ReLU             303                      1 1 302 303 0=1.000000e-01
ConvolutionDepthWise 304                      1 1 303 304 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        305                      1 1 304 305 0=16
ReLU             306                      1 1 305 306 0=1.000000e-01
Convolution      307                      1 1 306 307 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        308                      1 1 307 308 0=32
ReLU             309                      1 1 308 309 0=1.000000e-01
ConvolutionDepthWise 310                      1 1 309 310 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        311                      1 1 310 311 0=32
ReLU             312                      1 1 311 312 0=1.000000e-01
Convolution      313                      1 1 312 313 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        314                      1 1 313 314 0=32
ReLU             315                      1 1 314 315 0=1.000000e-01
ConvolutionDepthWise 316                      1 1 315 316 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        317                      1 1 316 317 0=32
ReLU             318                      1 1 317 318 0=1.000000e-01
Convolution      319                      1 1 318 319 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        320                      1 1 319 320 0=64
ReLU             321                      1 1 320 321 0=1.000000e-01
ConvolutionDepthWise 322                      1 1 321 322 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        323                      1 1 322 323 0=64
ReLU             324                      1 1 323 324 0=1.000000e-01
Convolution      325                      1 1 324 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        326                      1 1 325 326 0=64
ReLU             327                      1 1 326 327 0=1.000000e-01
Split            splitncnn_0              1 2 327 327_splitncnn_0 327_splitncnn_1
ConvolutionDepthWise 328                      1 1 327_splitncnn_1 328 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        329                      1 1 328 329 0=64
ReLU             330                      1 1 329 330 0=1.000000e-01
Convolution      331                      1 1 330 331 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        332                      1 1 331 332 0=128
ReLU             333                      1 1 332 333 0=1.000000e-01
ConvolutionDepthWise 334                      1 1 333 334 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        335                      1 1 334 335 0=128
ReLU             336                      1 1 335 336 0=1.000000e-01
Convolution      337                      1 1 336 337 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        338                      1 1 337 338 0=128
ReLU             339                      1 1 338 339 0=1.000000e-01
ConvolutionDepthWise 340                      1 1 339 340 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        341                      1 1 340 341 0=128
ReLU             342                      1 1 341 342 0=1.000000e-01
Convolution      343                      1 1 342 343 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        344                      1 1 343 344 0=128
ReLU             345                      1 1 344 345 0=1.000000e-01
ConvolutionDepthWise 346                      1 1 345 346 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        347                      1 1 346 347 0=128
ReLU             348                      1 1 347 348 0=1.000000e-01
Convolution      349                      1 1 348 349 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        350                      1 1 349 350 0=128
ReLU             351                      1 1 350 351 0=1.000000e-01
ConvolutionDepthWise 352                      1 1 351 352 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        353                      1 1 352 353 0=128
ReLU             354                      1 1 353 354 0=1.000000e-01
Convolution      355                      1 1 354 355 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        356                      1 1 355 356 0=128
ReLU             357                      1 1 356 357 0=1.000000e-01
ConvolutionDepthWise 358                      1 1 357 358 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        359                      1 1 358 359 0=128
ReLU             360                      1 1 359 360 0=1.000000e-01
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        362                      1 1 361 362 0=128
ReLU             363                      1 1 362 363 0=1.000000e-01
Split            splitncnn_1              1 2 363 363_splitncnn_0 363_splitncnn_1
ConvolutionDepthWise 364                      1 1 363_splitncnn_1 364 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        365                      1 1 364 365 0=128
ReLU             366                      1 1 365 366 0=1.000000e-01
Convolution      367                      1 1 366 367 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        368                      1 1 367 368 0=256
ReLU             369                      1 1 368 369 0=1.000000e-01
ConvolutionDepthWise 370                      1 1 369 370 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        371                      1 1 370 371 0=256
ReLU             372                      1 1 371 372 0=1.000000e-01
Convolution      373                      1 1 372 373 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        374                      1 1 373 374 0=256
ReLU             375                      1 1 374 375 0=1.000000e-01
Convolution      376                      1 1 327_splitncnn_0 376 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        377                      1 1 376 377 0=64
ReLU             378                      1 1 377 378 0=1.000000e-01
Convolution      379                      1 1 363_splitncnn_0 379 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        380                      1 1 379 380 0=64
ReLU             381                      1 1 380 381 0=1.000000e-01
Convolution      382                      1 1 375 382 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        383                      1 1 382 383 0=64
ReLU             384                      1 1 383 384 0=1.000000e-01
Split            splitncnn_2              1 3 384 384_splitncnn_0 384_splitncnn_1 384_splitncnn_2
Interp           401                      1 1 384_splitncnn_2 401 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         402                      2 1 381 401 402 0=0
Convolution      403                      1 1 402 403 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        404                      1 1 403 404 0=64
ReLU             405                      1 1 404 405 0=1.000000e-01
Split            splitncnn_3              1 3 405 405_splitncnn_0 405_splitncnn_1 405_splitncnn_2
Interp           422                      1 1 405_splitncnn_2 422 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         423                      2 1 378 422 423 0=0
Convolution      424                      1 1 423 424 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        425                      1 1 424 425 0=64
ReLU             426                      1 1 425 426 0=1.000000e-01
Split            splitncnn_4              1 2 426 426_splitncnn_0 426_splitncnn_1
Convolution      427                      1 1 426_splitncnn_1 427 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        428                      1 1 427 428 0=32
Convolution      429                      1 1 426_splitncnn_0 429 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        430                      1 1 429 430 0=16
ReLU             431                      1 1 430 431 0=1.000000e-01
Split            splitncnn_5              1 2 431 431_splitncnn_0 431_splitncnn_1
Convolution      432                      1 1 431_splitncnn_1 432 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        433                      1 1 432 433 0=16
Convolution      434                      1 1 431_splitncnn_0 434 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        435                      1 1 434 435 0=16
ReLU             436                      1 1 435 436 0=1.000000e-01
Convolution      437                      1 1 436 437 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        438                      1 1 437 438 0=16
Concat           439                      3 1 428 433 438 439 0=0
ReLU             440                      1 1 439 440
Split            splitncnn_6              1 2 440 440_splitncnn_0 440_splitncnn_1
Convolution      441                      1 1 405_splitncnn_1 441 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        442                      1 1 441 442 0=32
Convolution      443                      1 1 405_splitncnn_0 443 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        444                      1 1 443 444 0=16
ReLU             445                      1 1 444 445 0=1.000000e-01
Split            splitncnn_7              1 2 445 445_splitncnn_0 445_splitncnn_1
Convolution      446                      1 1 445_splitncnn_1 446 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        447                      1 1 446 447 0=16
Convolution      448                      1 1 445_splitncnn_0 448 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        449                      1 1 448 449 0=16
ReLU             450                      1 1 449 450 0=1.000000e-01
Convolution      451                      1 1 450 451 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        452                      1 1 451 452 0=16
Concat           453                      3 1 442 447 452 453 0=0
ReLU             454                      1 1 453 454
Split            splitncnn_8              1 2 454 454_splitncnn_0 454_splitncnn_1
Convolution      455                      1 1 384_splitncnn_1 455 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        456                      1 1 455 456 0=32
Convolution      457                      1 1 384_splitncnn_0 457 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        458                      1 1 457 458 0=16
ReLU             459                      1 1 458 459 0=1.000000e-01
Split            splitncnn_9              1 2 459 459_splitncnn_0 459_splitncnn_1
Convolution      460                      1 1 459_splitncnn_1 460 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        461                      1 1 460 461 0=16
Convolution      462                      1 1 459_splitncnn_0 462 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        463                      1 1 462 463 0=16
ReLU             464                      1 1 463 464 0=1.000000e-01
Convolution      465                      1 1 464 465 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        466                      1 1 465 466 0=16
Concat           467                      3 1 456 461 466 467 0=0
ReLU             468                      1 1 467 468
Split            splitncnn_10             1 2 468 468_splitncnn_0 468_splitncnn_1
Convolution      469                      1 1 440_splitncnn_1 469 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          470                      1 1 469 470 0=3
Reshape          480                      1 1 470 480 0=4 1=-1
Convolution      481                      1 1 454_splitncnn_1 481 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          482                      1 1 481 482 0=3
Reshape          492                      1 1 482 492 0=4 1=-1
Convolution      493                      1 1 468_splitncnn_1 493 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          494                      1 1 493 494 0=3
Reshape          504                      1 1 494 504 0=4 1=-1
Concat           output0                  3 1 480 492 504 output0 0=0
Convolution      506                      1 1 440_splitncnn_0 506 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          507                      1 1 506 507 0=3
Reshape          517                      1 1 507 517 0=2 1=-1
Convolution      518                      1 1 454_splitncnn_0 518 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          519                      1 1 518 519 0=3
Reshape          529                      1 1 519 529 0=2 1=-1
Convolution      530                      1 1 468_splitncnn_0 530 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          531                      1 1 530 531 0=3
Reshape          541                      1 1 531 541 0=2 1=-1
Concat           542                      3 1 517 529 541 542 0=0
Softmax          543                      1 1 542 543 0=1 1=1
