7767517
166 187
Input            input0                   0 1 input0
Convolution      253                      1 1 input0 253 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=0 6=9408
BatchNorm        254                      1 1 253 254 0=64
ReLU             255                      1 1 254 255
Pooling          256                      1 1 255 256 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 256 256_splitncnn_0 256_splitncnn_1
Convolution      257                      1 1 256_splitncnn_1 257 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        258                      1 1 257 258 0=64
ReLU             259                      1 1 258 259
Convolution      260                      1 1 259 260 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        261                      1 1 260 261 0=64
BinaryOp         262                      2 1 261 256_splitncnn_0 262 0=0
ReLU             263                      1 1 262 263
Split            splitncnn_1              1 2 263 263_splitncnn_0 263_splitncnn_1
Convolution      264                      1 1 263_splitncnn_1 264 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        265                      1 1 264 265 0=64
ReLU             266                      1 1 265 266
Convolution      267                      1 1 266 267 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        268                      1 1 267 268 0=64
BinaryOp         269                      2 1 268 263_splitncnn_0 269 0=0
ReLU             270                      1 1 269 270
Split            splitncnn_2              1 2 270 270_splitncnn_0 270_splitncnn_1
Convolution      271                      1 1 270_splitncnn_1 271 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=73728
BatchNorm        272                      1 1 271 272 0=128
ReLU             273                      1 1 272 273
Convolution      274                      1 1 273 274 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        275                      1 1 274 275 0=128
Convolution      276                      1 1 270_splitncnn_0 276 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        277                      1 1 276 277 0=128
BinaryOp         278                      2 1 275 277 278 0=0
ReLU             279                      1 1 278 279
Split            splitncnn_3              1 2 279 279_splitncnn_0 279_splitncnn_1
Convolution      280                      1 1 279_splitncnn_1 280 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        281                      1 1 280 281 0=128
ReLU             282                      1 1 281 282
Convolution      283                      1 1 282 283 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        284                      1 1 283 284 0=128
BinaryOp         285                      2 1 284 279_splitncnn_0 285 0=0
ReLU             286                      1 1 285 286
Split            splitncnn_4              1 3 286 286_splitncnn_0 286_splitncnn_1 286_splitncnn_2
Convolution      287                      1 1 286_splitncnn_2 287 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=294912
BatchNorm        288                      1 1 287 288 0=256
ReLU             289                      1 1 288 289
Convolution      290                      1 1 289 290 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        291                      1 1 290 291 0=256
Convolution      292                      1 1 286_splitncnn_1 292 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        293                      1 1 292 293 0=256
BinaryOp         294                      2 1 291 293 294 0=0
ReLU             295                      1 1 294 295
Split            splitncnn_5              1 2 295 295_splitncnn_0 295_splitncnn_1
Convolution      296                      1 1 295_splitncnn_1 296 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        297                      1 1 296 297 0=256
ReLU             298                      1 1 297 298
Convolution      299                      1 1 298 299 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        300                      1 1 299 300 0=256
BinaryOp         301                      2 1 300 295_splitncnn_0 301 0=0
ReLU             302                      1 1 301 302
Split            splitncnn_6              1 3 302 302_splitncnn_0 302_splitncnn_1 302_splitncnn_2
Convolution      303                      1 1 302_splitncnn_2 303 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1179648
BatchNorm        304                      1 1 303 304 0=512
ReLU             305                      1 1 304 305
Convolution      306                      1 1 305 306 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2359296
BatchNorm        307                      1 1 306 307 0=512
Convolution      308                      1 1 302_splitncnn_1 308 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=131072
BatchNorm        309                      1 1 308 309 0=512
BinaryOp         310                      2 1 307 309 310 0=0
ReLU             311                      1 1 310 311
Split            splitncnn_7              1 2 311 311_splitncnn_0 311_splitncnn_1
Convolution      312                      1 1 311_splitncnn_1 312 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2359296
BatchNorm        313                      1 1 312 313 0=512
ReLU             314                      1 1 313 314
Convolution      315                      1 1 314 315 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2359296
BatchNorm        316                      1 1 315 316 0=512
BinaryOp         317                      2 1 316 311_splitncnn_0 317 0=0
ReLU             318                      1 1 317 318
Convolution      319                      1 1 286_splitncnn_0 319 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        320                      1 1 319 320 0=64
ReLU             321                      1 1 320 321 0=1.000000e-01
Convolution      322                      1 1 302_splitncnn_0 322 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        323                      1 1 322 323 0=64
ReLU             324                      1 1 323 324 0=1.000000e-01
Convolution      325                      1 1 318 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        326                      1 1 325 326 0=64
ReLU             327                      1 1 326 327 0=1.000000e-01
Split            splitncnn_8              1 3 327 327_splitncnn_0 327_splitncnn_1 327_splitncnn_2
Interp           344                      1 1 327_splitncnn_2 344 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         345                      2 1 324 344 345 0=0
Convolution      346                      1 1 345 346 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        347                      1 1 346 347 0=64
ReLU             348                      1 1 347 348 0=1.000000e-01
Split            splitncnn_9              1 3 348 348_splitncnn_0 348_splitncnn_1 348_splitncnn_2
Interp           365                      1 1 348_splitncnn_2 365 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         366                      2 1 321 365 366 0=0
Convolution      367                      1 1 366 367 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        368                      1 1 367 368 0=64
ReLU             369                      1 1 368 369 0=1.000000e-01
Split            splitncnn_10             1 2 369 369_splitncnn_0 369_splitncnn_1
Convolution      370                      1 1 369_splitncnn_1 370 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        371                      1 1 370 371 0=32
Convolution      372                      1 1 369_splitncnn_0 372 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        373                      1 1 372 373 0=16
ReLU             374                      1 1 373 374 0=1.000000e-01
Split            splitncnn_11             1 2 374 374_splitncnn_0 374_splitncnn_1
Convolution      375                      1 1 374_splitncnn_1 375 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        376                      1 1 375 376 0=16
Convolution      377                      1 1 374_splitncnn_0 377 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        378                      1 1 377 378 0=16
ReLU             379                      1 1 378 379 0=1.000000e-01
Convolution      380                      1 1 379 380 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        381                      1 1 380 381 0=16
Concat           382                      3 1 371 376 381 382 0=0
ReLU             383                      1 1 382 383
Split            splitncnn_12             1 2 383 383_splitncnn_0 383_splitncnn_1
Convolution      384                      1 1 348_splitncnn_1 384 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        385                      1 1 384 385 0=32
Convolution      386                      1 1 348_splitncnn_0 386 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        387                      1 1 386 387 0=16
ReLU             388                      1 1 387 388 0=1.000000e-01
Split            splitncnn_13             1 2 388 388_splitncnn_0 388_splitncnn_1
Convolution      389                      1 1 388_splitncnn_1 389 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        390                      1 1 389 390 0=16
Convolution      391                      1 1 388_splitncnn_0 391 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        392                      1 1 391 392 0=16
ReLU             393                      1 1 392 393 0=1.000000e-01
Convolution      394                      1 1 393 394 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        395                      1 1 394 395 0=16
Concat           396                      3 1 385 390 395 396 0=0
ReLU             397                      1 1 396 397
Split            splitncnn_14             1 2 397 397_splitncnn_0 397_splitncnn_1
Convolution      398                      1 1 327_splitncnn_1 398 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        399                      1 1 398 399 0=32
Convolution      400                      1 1 327_splitncnn_0 400 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        401                      1 1 400 401 0=16
ReLU             402                      1 1 401 402 0=1.000000e-01
Split            splitncnn_15             1 2 402 402_splitncnn_0 402_splitncnn_1
Convolution      403                      1 1 402_splitncnn_1 403 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        404                      1 1 403 404 0=16
Convolution      405                      1 1 402_splitncnn_0 405 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        406                      1 1 405 406 0=16
ReLU             407                      1 1 406 407 0=1.000000e-01
Convolution      408                      1 1 407 408 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        409                      1 1 408 409 0=16
Concat           410                      3 1 399 404 409 410 0=0
ReLU             411                      1 1 410 411
Split            splitncnn_16             1 2 411 411_splitncnn_0 411_splitncnn_1
Convolution      412                      1 1 383_splitncnn_1 412 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          413                      1 1 412 413 0=3
Reshape          423                      1 1 413 423 0=4 1=-1
Convolution      424                      1 1 397_splitncnn_1 424 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          425                      1 1 424 425 0=3
Reshape          435                      1 1 425 435 0=4 1=-1
Convolution      436                      1 1 411_splitncnn_1 436 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          437                      1 1 436 437 0=3
Reshape          447                      1 1 437 447 0=4 1=-1
Concat           output0                  3 1 423 435 447 output0 0=0
Convolution      449                      1 1 383_splitncnn_0 449 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          450                      1 1 449 450 0=3
Reshape          460                      1 1 450 460 0=2 1=-1
Convolution      461                      1 1 397_splitncnn_0 461 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          462                      1 1 461 462 0=3
Reshape          472                      1 1 462 472 0=2 1=-1
Convolution      473                      1 1 411_splitncnn_0 473 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          474                      1 1 473 474 0=3
Reshape          484                      1 1 474 484 0=2 1=-1
Concat           485                      3 1 460 472 484 485 0=0
Softmax          486                      1 1 485 486 0=1 1=1
